apache/mynewt-core/hw/drivers/i2s/i2s_stm32f7/src/i2s_stm32f7.c
/*
 * Following functions:
 * i2s_dma_error(), i2s_receive_start_dma() i2s_transmit_start_dma(), i2s_transmit_receive_dma()
 * are close copies of ST HAL functions with exception that they program DMA in double buffering
 * mode.  Style and naming is in most part unchanged.
 */
static void
i2s_dma_error(DMA_HandleTypeDef *hdma)
{
    I2S_HandleTypeDef *hi2s = (I2S_HandleTypeDef *)((DMA_HandleTypeDef *)hdma)->Parent; /* Derogation MISRAC2012-Rule-11.5 */

    /* Disable Rx and Tx DMA Request */
    CLEAR_BIT(hi2s->Instance->CR2, (SPI_CR2_RXDMAEN | SPI_CR2_TXDMAEN));
    hi2s->TxXferCount = 0U;
    hi2s->RxXferCount = 0U;

    hi2s->State = HAL_I2S_STATE_READY;

    /* Set the error code and execute error callback */
    SET_BIT(hi2s->ErrorCode, HAL_I2S_ERROR_DMA);
    /* Call user error callback */
#if (USE_HAL_I2S_REGISTER_CALLBACKS == 1U)
    hi2s->ErrorCallback(hi2s);
#else
    HAL_I2S_ErrorCallback(hi2s);
#endif /* USE_HAL_I2S_REGISTER_CALLBACKS */
}

static HAL_StatusTypeDef
i2s_receive_start_dma(I2S_HandleTypeDef *hi2s, uint16_t *buf0, uint16_t *buf1, uint16_t sample_count)
{
    uint32_t tmpreg_cfgr;
    uint16_t size;

    if ((buf0 == NULL) || (buf1 == NULL) || (sample_count == 0)) {
        return HAL_ERROR;
    }

    /* Process Locked */
    __HAL_LOCK(hi2s);

    if (hi2s->State != HAL_I2S_STATE_READY) {
        __HAL_UNLOCK(hi2s);
        return HAL_BUSY;
    }

    /* Set state and reset error code */
    hi2s->State = HAL_I2S_STATE_BUSY_RX;
    hi2s->ErrorCode = HAL_I2S_ERROR_NONE;
    hi2s->pRxBuffPtr = buf0;

    tmpreg_cfgr = hi2s->Instance->I2SCFGR & (SPI_I2SCFGR_DATLEN | SPI_I2SCFGR_CHLEN);

    if ((tmpreg_cfgr == I2S_DATAFORMAT_24B) || (tmpreg_cfgr == I2S_DATAFORMAT_32B)) {
        size = sample_count << 1U;
    } else {
        size = sample_count;
    }

    /* Half transfer callback not needed */
    hi2s->hdmarx->XferHalfCpltCallback = NULL;

    /* Set the I2S Rx DMA transfer complete callback */
    hi2s->hdmarx->XferCpltCallback = i2s_dma_m0_complete;
    hi2s->hdmarx->XferM1CpltCallback = i2s_dma_m1_complete;

    /* Set the DMA error callback */
    hi2s->hdmarx->XferErrorCallback = i2s_dma_error;

    /* Check if Master Receiver mode is selected */
    if ((hi2s->Instance->I2SCFGR & SPI_I2SCFGR_I2SCFG) == I2S_MODE_MASTER_RX) {
        /*
         * Clear the Overrun Flag by a read operation to the SPI_DR register followed by a read
         * access to the SPI_SR register.
         */
        __HAL_I2S_CLEAR_OVRFLAG(hi2s);
    }

    hi2s->hdmarx->Instance->CR &= ~DMA_SxCR_CT_Msk;
    /* Enable the Rx DMA Stream/Channel */
    if (HAL_OK != HAL_DMAEx_MultiBufferStart_IT(hi2s->hdmarx, (uint32_t)&hi2s->Instance->DR,
                                                (uint32_t)buf0, (uint32_t)buf1, size)) {
        /* Update SPI error code */
        SET_BIT(hi2s->ErrorCode, HAL_I2S_ERROR_DMA);
        hi2s->State = HAL_I2S_STATE_READY;

        __HAL_UNLOCK(hi2s);
        return HAL_ERROR;
    }

    /* Check if the I2S is already enabled */
    if (HAL_IS_BIT_CLR(hi2s->Instance->I2SCFGR, SPI_I2SCFGR_I2SE)) {
        /* Enable I2S peripheral */
        __HAL_I2S_ENABLE(hi2s);
    }

    /* Check if the I2S Rx request is already enabled */
    if (HAL_IS_BIT_CLR(hi2s->Instance->CR2, SPI_CR2_RXDMAEN)) {
        /* Enable Rx DMA Request */
        SET_BIT(hi2s->Instance->CR2, SPI_CR2_RXDMAEN);
    }

    __HAL_UNLOCK(hi2s);
    return HAL_OK;
}

static HAL_StatusTypeDef
i2s_transmit_start_dma(I2S_HandleTypeDef *hi2s, uint16_t *buf0, uint16_t *buf1, uint16_t sample_count)
{
    uint32_t tmpreg_cfgr;
    uint16_t size;

    if ((buf0 == NULL) || (buf1 == NULL) || (sample_count == 0)) {
        return HAL_ERROR;
    }

    /* Process Locked */
    __HAL_LOCK(hi2s);

    if (hi2s->State != HAL_I2S_STATE_READY) {
        __HAL_UNLOCK(hi2s);
        return HAL_BUSY;
    }

    /* Set state and reset error code */
    hi2s->State = HAL_I2S_STATE_BUSY_TX;
    hi2s->ErrorCode = HAL_I2S_ERROR_NONE;
    hi2s->pTxBuffPtr = buf0;

    tmpreg_cfgr = hi2s->Instance->I2SCFGR & (SPI_I2SCFGR_DATLEN | SPI_I2SCFGR_CHLEN);

    if ((tmpreg_cfgr == I2S_DATAFORMAT_24B) || (tmpreg_cfgr == I2S_DATAFORMAT_32B)) {
        size = sample_count << 1U;
    } else {
        size = sample_count;
    }

    /* Set the I2S Tx DMA Half transfer complete callback */
    hi2s->hdmatx->XferHalfCpltCallback = NULL;

    /* Set the I2S Tx DMA transfer complete callback */
    hi2s->hdmatx->XferCpltCallback = i2s_dma_m0_complete;
    hi2s->hdmatx->XferM1CpltCallback = i2s_dma_m1_complete;

    /* Set the DMA error callback */
    hi2s->hdmatx->XferErrorCallback = i2s_dma_error;

    hi2s->hdmatx->Instance->CR &= ~DMA_SxCR_CT_Msk;
    /* Enable the Tx DMA Stream/Channel */
    if (HAL_OK != HAL_DMAEx_MultiBufferStart_IT(hi2s->hdmatx, (uint32_t)buf0, (uint32_t)&hi2s->Instance->DR,
                                                (uint32_t)buf1, size)) {
        /* Update SPI error code */
        SET_BIT(hi2s->ErrorCode, HAL_I2S_ERROR_DMA);
        hi2s->State = HAL_I2S_STATE_READY;

        __HAL_UNLOCK(hi2s);
        return HAL_ERROR;
    }

    /* Check if the I2S is already enabled */
    if (HAL_IS_BIT_CLR(hi2s->Instance->I2SCFGR, SPI_I2SCFGR_I2SE)) {
        /* Enable I2S peripheral */
        __HAL_I2S_ENABLE(hi2s);
    }

    /* Check if the I2S Rx request is already enabled */
    if (HAL_IS_BIT_CLR(hi2s->Instance->CR2, SPI_CR2_TXDMAEN)) {
        /* Enable Rx DMA Request */
        SET_BIT(hi2s->Instance->CR2, SPI_CR2_TXDMAEN);
    }

    __HAL_UNLOCK(hi2s);
    return HAL_OK;
}

int
i2s_driver_start(struct i2s *i2s)
{
    int rc = 0;
    struct stm32_i2s *i2s_data = (struct stm32_i2s *)i2s->driver_data;

    switch (i2s_data->hi2s.State) {
    case HAL_I2S_STATE_RESET:
        if (i2s->sample_rate) {
            i2s_data->hi2s.Init.AudioFreq = i2s->sample_rate;
        }
        if (HAL_I2S_Init(&i2s_data->hi2s) != HAL_OK) {
            rc = SYS_EUNKNOWN;
            break;
        }
        if (HAL_DMA_Init(i2s_data->hdma_spi) != HAL_OK) {
            (void)HAL_I2S_DeInit(&i2s_data->hi2s);
            rc = SYS_EUNKNOWN;
            break;
        }
    /* Fallthrough */
    case HAL_I2S_STATE_READY:
        assert(i2s_data->dma_buffers[0] == NULL);
        assert(i2s_data->dma_buffers[1] == NULL);
        assert(i2s_data->dma_buffer_count == 0);
        i2s_data->dma_buffers[0] = i2s_driver_buffer_get(i2s);
        i2s_data->dma_buffers[1] = i2s_driver_buffer_get(i2s);
        if (i2s_data->dma_buffers[0] == NULL) {
            i2s->state = I2S_STATE_OUT_OF_BUFFERS;
            rc = I2S_ERR_NO_BUFFER;
            break;
        }
        if (i2s_data->dma_buffers[1] == NULL) {
            i2s_data->dma_buffers[1] = i2s_data->dma_buffers[0];
            i2s_data->dma_buffer_count = 1;
        } else {
            i2s_data->dma_buffer_count = 2;
        }
        i2s->state = I2S_STATE_RUNNING;
        if (i2s->direction == I2S_IN) {
            i2s_data->dma_buffers[0]->sample_count = i2s_data->dma_buffers[0]->capacity;
            assert(i2s_data->dma_buffers[0]->capacity == i2s_data->dma_buffers[1]->capacity);
            i2s_receive_start_dma(&i2s_data->hi2s, i2s_data->dma_buffers[0]->sample_data,
                                  i2s_data->dma_buffers[1]->sample_data, i2s_data->dma_buffers[0]->sample_count);
        } else if (i2s->direction == I2S_OUT) {
            i2s_transmit_start_dma(&i2s_data->hi2s,
                                   i2s_data->dma_buffers[0]->sample_data,
                                   i2s_data->dma_buffers[1]->sample_data,
                                   i2s_data->dma_buffers[0]->sample_count);
        }
        break;
    case HAL_I2S_STATE_BUSY:
    case HAL_I2S_STATE_BUSY_RX:
    case HAL_I2S_STATE_BUSY_TX:
        break;
    default:
        rc = I2S_ERR_INTERNAL;
    }
    return rc;
}

void
i2s_driver_buffer_queued(struct i2s *i2s)
{
    struct stm32_i2s *i2s_data = (struct stm32_i2s *)i2s->driver_data;
    struct i2s_sample_buffer *next_buffer;
    int sr;
    int inactive_memory_buffer_ix;
    uint32_t sample_buffer_addr;

    if (i2s->state != I2S_STATE_RUNNING) {
        return;
    }
    OS_ENTER_CRITICAL(sr);
    switch (i2s_data->dma_buffer_count) {
    case 0:
        i2s_data->dma_buffers[0] = i2s_driver_buffer_get(i2s);
        i2s_data->dma_buffer_count = 1;
        break;
    case 1:
        next_buffer = i2s_driver_buffer_get(i2s);
        if ((i2s_data->hdma_spi->Instance->CR & DMA_SxCR_EN) == 0) {
            i2s_data->dma_buffers[1] = next_buffer;
        } else {
            sample_buffer_addr = (uint32_t)next_buffer->sample_data;
            /* DMA is active with just one buffer, inactive buffer needs to be changed. */
            inactive_memory_buffer_ix = (i2s_data->hdma_spi->Instance->CR & DMA_SxCR_CT_Msk) ? 0 : 1;
            HAL_DMAEx_ChangeMemory(i2s_data->hdma_spi, sample_buffer_addr,
                                   inactive_memory_buffer_ix ? MEMORY1 : MEMORY0);
            if ((i2s_data->hdma_spi->Instance->CR & DMA_SxCR_EN_Msk) == 0) {
                /*
                 * There was race between checking current buffer and settings next.
                 * In this case M1AR or M0AR was write protected and write did not succeeded,
                 * Just write the other memory address.
                 */
                inactive_memory_buffer_ix ^= 1;
                HAL_DMAEx_ChangeMemory(i2s_data->hdma_spi, sample_buffer_addr,
                                       inactive_memory_buffer_ix ? MEMORY1 : MEMORY0);

