apache/mynewt-core/hw/drivers/i2s/i2s_stm32f7/src/i2s_stm32f7.c
                /* Writing to MxAR that was used stopped transfer with errors, make it continue */
                __HAL_DMA_CLEAR_FLAG(i2s_data->hdma_spi,
                                     (DMA_FLAG_FEIF0_4 | DMA_FLAG_DMEIF0_4 |
                                      DMA_FLAG_TEIF0_4 | DMA_FLAG_HTIF0_4 |
                                      DMA_FLAG_TCIF0_4) << i2s_data->hdma_spi->StreamIndex);
                i2s_data->hdma_spi->Instance->CR |= DMA_SxCR_EN;
            }
            i2s_data->dma_buffers[inactive_memory_buffer_ix] = next_buffer;
        }
        i2s_data->dma_buffer_count = 2;
        break;
    default:
        break;
    }
    OS_EXIT_CRITICAL(sr);
}

int
i2s_driver_suspend(struct i2s *i2s, os_time_t timeout, int arg)
{
    return OS_OK;
}

int
i2s_driver_resume(struct i2s *i2s)
{
    return OS_OK;
}

bool
i2s_out_is_active(struct i2s *i2s)
{
    struct stm32_i2s *i2s_data = (struct stm32_i2s *)i2s->driver_data;
    return READ_BIT(i2s_data->hi2s.Instance->I2SCFGR, SPI_I2SCFGR_I2SE) != 0;
}

#define I2S_PIN_DEFINE(n, po, pi, af) \
    const struct stm32_pin_cfg I2S ## n ## _P ## po ## pi = {    \
        .pin = MCU_GPIO_PORT ## po(pi),                          \
        .hal_init = {                                            \
            .Pin = GPIO_PIN_ ## pi,                              \
            .Mode = GPIO_MODE_AF_PP,                             \
            .Pull = GPIO_NOPULL,                                 \
            .Speed = GPIO_SPEED_FREQ_LOW,                        \
            .Alternate = af,                                     \
        }                                                        \
    }

#define I2S_CK_PIN_DEFINE(n, po, pi, af) \
    const struct stm32_pin_cfg I2S ## n ## _CK_P ## po ## pi = { \
        .pin = MCU_GPIO_PORT ## po(pi),                          \
        .hal_init = {                                            \
            .Pin = GPIO_PIN_ ## pi,                              \
            .Mode = GPIO_MODE_AF_PP,                             \
            .Pull = GPIO_NOPULL,                                 \
            .Speed = GPIO_SPEED_FREQ_LOW,                        \
            .Alternate = af,                                     \
        }                                                        \
    }

#define I2S_WS_PIN_DEFINE(n, po, pi, af) \
    const struct stm32_pin_cfg I2S ## n ## _WS_P ## po ## pi = { \
        .pin = MCU_GPIO_PORT ## po(pi),                          \
        .hal_init = {                                            \
            .Pin = GPIO_PIN_ ## pi,                              \
            .Mode = GPIO_MODE_AF_PP,                             \
            .Pull = GPIO_NOPULL,                                 \
            .Speed = GPIO_SPEED_FREQ_LOW,                        \
            .Alternate = af,                                     \
        }                                                        \
    }

#define I2S_SD_PIN_DEFINE(n, po, pi, af) \
    const struct stm32_pin_cfg I2S ## n ## _SD_P ## po ## pi = { \
        .pin = MCU_GPIO_PORT ## po(pi),                          \
        .hal_init = {                                            \
            .Pin = GPIO_PIN_ ## pi,                              \
            .Mode = GPIO_MODE_AF_PP,                             \
            .Pull = GPIO_NOPULL,                                 \
            .Speed = GPIO_SPEED_FREQ_LOW,                        \
            .Alternate = af,                                     \
        }                                                        \
    }

/* I2S1 Possible CK pins */
I2S_CK_PIN_DEFINE(1, A, 5, GPIO_AF5_SPI1);
I2S_CK_PIN_DEFINE(1, B, 3, GPIO_AF5_SPI1);
I2S_CK_PIN_DEFINE(1, G, 11, GPIO_AF5_SPI1);

/* I2S1 possible WS pins */
I2S_WS_PIN_DEFINE(1, A, 4, GPIO_AF5_SPI1);
I2S_WS_PIN_DEFINE(1, A, 15, GPIO_AF5_SPI1);
I2S_WS_PIN_DEFINE(1, G, 10, GPIO_AF5_SPI1);

/* I2S1 possible SD pins */
I2S_SD_PIN_DEFINE(1, B, 5, GPIO_AF5_SPI1);
I2S_SD_PIN_DEFINE(1, A, 7, GPIO_AF5_SPI1);
I2S_SD_PIN_DEFINE(1, D, 7, GPIO_AF5_SPI1);

/* I2S1 possible MCK pins */
I2S_SD_PIN_DEFINE(1, C, 4, GPIO_AF5_SPI1);

/* I2S2 Possible CKIN pins */
I2S_PIN_DEFINE(2, C, 9, GPIO_AF5_SPI2);

/* I2S2 Possible MCK pins */
#ifdef GPIO_AF5_SPI2
I2S_PIN_DEFINE(2, C, 6, GPIO_AF5_SPI2);
#endif

/* I2S2 Possible CK pins */
I2S_CK_PIN_DEFINE(2, A, 9, GPIO_AF5_SPI2);
I2S_CK_PIN_DEFINE(2, A, 12, GPIO_AF5_SPI2);
I2S_CK_PIN_DEFINE(2, B, 10, GPIO_AF5_SPI2);
I2S_CK_PIN_DEFINE(2, B, 13, GPIO_AF5_SPI2);
I2S_CK_PIN_DEFINE(2, D, 3, GPIO_AF5_SPI2);
I2S_CK_PIN_DEFINE(2, I, 1, GPIO_AF5_SPI2);

/* I2S2 possible WS pins */
I2S_WS_PIN_DEFINE(2, A, 11, GPIO_AF5_SPI2);
I2S_WS_PIN_DEFINE(2, B, 4, GPIO_AF7_SPI2);
I2S_WS_PIN_DEFINE(2, B, 9, GPIO_AF5_SPI2);
I2S_WS_PIN_DEFINE(2, B, 12, GPIO_AF5_SPI2);
I2S_WS_PIN_DEFINE(2, I, 0, GPIO_AF5_SPI2);

/* I2S2 possible SD pins */
I2S_SD_PIN_DEFINE(2, B, 15, GPIO_AF5_SPI2);
I2S_SD_PIN_DEFINE(2, C, 1, GPIO_AF5_SPI2);
I2S_SD_PIN_DEFINE(2, C, 3, GPIO_AF5_SPI2);
I2S_SD_PIN_DEFINE(2, I, 3, GPIO_AF5_SPI2);

/* I2S3 possible CK pins */
I2S_CK_PIN_DEFINE(3, B, 3, GPIO_AF6_SPI3);
I2S_CK_PIN_DEFINE(3, C, 10, GPIO_AF6_SPI3);

/* I2S3 possible WS pins */
I2S_WS_PIN_DEFINE(3, A, 4, GPIO_AF6_SPI3);
I2S_WS_PIN_DEFINE(3, A, 15, GPIO_AF6_SPI3);

/* I2S3 possible SD pins */
I2S_SD_PIN_DEFINE(3, B, 2, GPIO_AF6_SPI3);
I2S_SD_PIN_DEFINE(3, B, 5, GPIO_AF6_SPI3);
I2S_SD_PIN_DEFINE(3, C, 12, GPIO_AF6_SPI3);
#ifdef GPIO_AF5_SPI3
I2S_SD_PIN_DEFINE(3, D, 6, GPIO_AF5_SPI3);
#endif

/* I2S3 possible MCK pins */
I2S_PIN_DEFINE(3, C, 7, GPIO_AF6_SPI3);

#define DMA_STREAM_DEFINE(dma, ch, st, name) \
    const struct stm32_dma_cfg name ## _stream ## st ## _channel ## ch = {  \
        dma,                                                                \
        DMA ## dma ## _Stream ## st ## _IRQn,                               \
        DMA ## dma ## _Stream ## st,                                        \
        DMA_CHANNEL_ ## ch,                                                 \
    }

