apache/mynewt-core/hw/drivers/i2s/i2s_stm32f7/src/i2s_stm32f7.c
DMA_STREAM_DEFINE(1, 0, 0, spi3_rx);
DMA_STREAM_DEFINE(1, 0, 1, spdifrx_dt);
DMA_STREAM_DEFINE(1, 0, 2, spi3_rx);
DMA_STREAM_DEFINE(1, 0, 3, spi2_rx);
DMA_STREAM_DEFINE(1, 0, 4, spi2_tx);
DMA_STREAM_DEFINE(1, 0, 5, spi3_tx);
DMA_STREAM_DEFINE(1, 0, 6, spdifrx_cs);
DMA_STREAM_DEFINE(1, 0, 7, spi3_tx);

DMA_STREAM_DEFINE(1, 1, 0, i2c1_rx);
DMA_STREAM_DEFINE(1, 1, 1, i2c3_rx);
DMA_STREAM_DEFINE(1, 1, 2, tim7_up);
DMA_STREAM_DEFINE(1, 1, 4, tim7_up);
DMA_STREAM_DEFINE(1, 1, 5, i2c1_rx);
DMA_STREAM_DEFINE(1, 1, 6, i2c1_tx);
DMA_STREAM_DEFINE(1, 1, 7, i2c1_tx);

DMA_STREAM_DEFINE(1, 2, 0, tim4_ch1);
DMA_STREAM_DEFINE(1, 2, 2, i2c4_rx);
DMA_STREAM_DEFINE(1, 2, 3, tim4_ch2);
DMA_STREAM_DEFINE(1, 2, 5, i2c4_rx);
DMA_STREAM_DEFINE(1, 2, 6, tim4_up);
DMA_STREAM_DEFINE(1, 2, 7, tim4_ch3);

DMA_STREAM_DEFINE(1, 3, 1, tim2_up);
DMA_STREAM_DEFINE(1, 3, 1, tim2_ch3);
DMA_STREAM_DEFINE(1, 3, 2, i2c3_rx);
DMA_STREAM_DEFINE(1, 3, 4, i2c3_tx);
DMA_STREAM_DEFINE(1, 3, 5, tim2_ch1);
DMA_STREAM_DEFINE(1, 3, 6, tim2_ch2);
DMA_STREAM_DEFINE(1, 3, 6, tim2_ch4);
DMA_STREAM_DEFINE(1, 3, 7, tim2_up);
DMA_STREAM_DEFINE(1, 3, 7, tim2_ch4);

DMA_STREAM_DEFINE(1, 4, 0, uart5_rx);
DMA_STREAM_DEFINE(1, 4, 1, usart3_rx);
DMA_STREAM_DEFINE(1, 4, 2, uart4_rx);
DMA_STREAM_DEFINE(1, 4, 3, usart3_tx);
DMA_STREAM_DEFINE(1, 4, 4, uart4_tx);
DMA_STREAM_DEFINE(1, 4, 5, usart2_rx);
DMA_STREAM_DEFINE(1, 4, 6, usart2_tx);
DMA_STREAM_DEFINE(1, 4, 7, uart5_tx);

DMA_STREAM_DEFINE(1, 5, 0, uart8_tx);
DMA_STREAM_DEFINE(1, 5, 1, uart7_tx);
DMA_STREAM_DEFINE(1, 5, 2, tim3_ch4);
DMA_STREAM_DEFINE(1, 5, 2, tim3_up);
DMA_STREAM_DEFINE(1, 5, 3, uart7_rx);
DMA_STREAM_DEFINE(1, 5, 4, tim3_ch1);
DMA_STREAM_DEFINE(1, 5, 4, tim3_trig);
DMA_STREAM_DEFINE(1, 5, 5, tim3_ch2);
DMA_STREAM_DEFINE(1, 5, 6, uart8_rx);
DMA_STREAM_DEFINE(1, 5, 7, tim3_ch3);

DMA_STREAM_DEFINE(1, 6, 0, tim5_ch3);
DMA_STREAM_DEFINE(1, 6, 0, tim5_up);
DMA_STREAM_DEFINE(1, 6, 1, tim5_ch4);
DMA_STREAM_DEFINE(1, 6, 1, tim5_trig);
DMA_STREAM_DEFINE(1, 6, 2, tim5_ch1);
DMA_STREAM_DEFINE(1, 6, 2, tim3_up);
DMA_STREAM_DEFINE(1, 6, 3, tim5_ch4);
DMA_STREAM_DEFINE(1, 6, 3, tim5_trig);
DMA_STREAM_DEFINE(1, 6, 4, tim5_ch2);
DMA_STREAM_DEFINE(1, 6, 6, tim5_up);

DMA_STREAM_DEFINE(1, 7, 1, tim6_up);
DMA_STREAM_DEFINE(1, 7, 2, i2c2_rx);
DMA_STREAM_DEFINE(1, 7, 3, i2c2_rx);
DMA_STREAM_DEFINE(1, 7, 4, usart3_tx);
DMA_STREAM_DEFINE(1, 7, 5, dac1);
DMA_STREAM_DEFINE(1, 7, 6, dac2);
DMA_STREAM_DEFINE(1, 7, 7, i2c2_tx);

DMA_STREAM_DEFINE(1, 8, 0, i2c3_tx);
DMA_STREAM_DEFINE(1, 8, 1, i2c4_rx);
DMA_STREAM_DEFINE(1, 8, 4, i2c2_tx);
DMA_STREAM_DEFINE(1, 8, 6, i2c4_tx);

DMA_STREAM_DEFINE(1, 9, 1, i2c2_rx);
DMA_STREAM_DEFINE(1, 9, 6, i2c2_tx);

DMA_STREAM_DEFINE(2, 0, 0, adc1);
DMA_STREAM_DEFINE(2, 0, 1, sai1_a);
DMA_STREAM_DEFINE(2, 0, 2, tim8_ch1);
DMA_STREAM_DEFINE(2, 0, 2, tim8_ch2);
DMA_STREAM_DEFINE(2, 0, 2, tim8_ch3);
DMA_STREAM_DEFINE(2, 0, 3, sai1_a);
DMA_STREAM_DEFINE(2, 0, 4, adc1);
DMA_STREAM_DEFINE(2, 0, 5, sai1_b);
DMA_STREAM_DEFINE(2, 0, 6, tim1_ch1);
DMA_STREAM_DEFINE(2, 0, 6, tim1_ch2);
DMA_STREAM_DEFINE(2, 0, 6, tim1_ch3);
DMA_STREAM_DEFINE(2, 0, 7, sai1_b);

DMA_STREAM_DEFINE(2, 1, 1, dcmi);
DMA_STREAM_DEFINE(2, 1, 2, adc2);
DMA_STREAM_DEFINE(2, 1, 3, adc2);
DMA_STREAM_DEFINE(2, 1, 4, sai1_b);
DMA_STREAM_DEFINE(2, 1, 5, spi6_tx);
DMA_STREAM_DEFINE(2, 1, 6, spi6_rx);
DMA_STREAM_DEFINE(2, 1, 7, dcmi);

DMA_STREAM_DEFINE(2, 2, 0, adc3);
DMA_STREAM_DEFINE(2, 2, 1, adc3);
DMA_STREAM_DEFINE(2, 2, 3, spi5_rx);
DMA_STREAM_DEFINE(2, 2, 4, spi5_tx);
DMA_STREAM_DEFINE(2, 2, 5, cryp_out);
DMA_STREAM_DEFINE(2, 2, 6, cryp_in);
DMA_STREAM_DEFINE(2, 2, 7, hash_in);

DMA_STREAM_DEFINE(2, 3, 0, spi1_rx);
DMA_STREAM_DEFINE(2, 3, 2, spi1_rx);
DMA_STREAM_DEFINE(2, 3, 3, spi1_tx);
DMA_STREAM_DEFINE(2, 3, 4, sai2_a);
DMA_STREAM_DEFINE(2, 3, 5, spi1_tx);
DMA_STREAM_DEFINE(2, 3, 6, sai2_b);
DMA_STREAM_DEFINE(2, 3, 7, quadspi);

DMA_STREAM_DEFINE(2, 4, 0, spi4_rx);
DMA_STREAM_DEFINE(2, 4, 1, spi4_tx);
DMA_STREAM_DEFINE(2, 4, 2, usart1_rx);
DMA_STREAM_DEFINE(2, 4, 3, sdmmc1);
DMA_STREAM_DEFINE(2, 4, 5, usart1_rx);
DMA_STREAM_DEFINE(2, 4, 6, sdmmc1);
DMA_STREAM_DEFINE(2, 4, 7, usart1_tx);

DMA_STREAM_DEFINE(2, 5, 1, usart6_rx);
DMA_STREAM_DEFINE(2, 5, 2, usart6_rx);
DMA_STREAM_DEFINE(2, 5, 3, spi4_rx);
DMA_STREAM_DEFINE(2, 5, 4, spi4_tx);
DMA_STREAM_DEFINE(2, 5, 5, spi5_tx);
DMA_STREAM_DEFINE(2, 5, 6, usart6_tx);
DMA_STREAM_DEFINE(2, 5, 7, usart6_tx);

DMA_STREAM_DEFINE(2, 6, 0, tim1_trig);
DMA_STREAM_DEFINE(2, 6, 1, tim1_ch1);
DMA_STREAM_DEFINE(2, 6, 2, tim1_ch2);
DMA_STREAM_DEFINE(2, 6, 3, tim1_ch1);
DMA_STREAM_DEFINE(2, 6, 4, tim1_ch4);
DMA_STREAM_DEFINE(2, 6, 4, tim1_trig);
DMA_STREAM_DEFINE(2, 6, 4, tim1_com);
DMA_STREAM_DEFINE(2, 6, 5, tim1_up);
DMA_STREAM_DEFINE(2, 6, 6, tim1_ch3);

DMA_STREAM_DEFINE(2, 7, 1, tim8_up);
DMA_STREAM_DEFINE(2, 7, 2, tim8_ch1);
DMA_STREAM_DEFINE(2, 7, 3, tim8_ch2);
DMA_STREAM_DEFINE(2, 7, 4, tim8_ch3);
DMA_STREAM_DEFINE(2, 7, 5, spi5_rx);
DMA_STREAM_DEFINE(2, 7, 6, spi5_tx);
DMA_STREAM_DEFINE(2, 7, 7, tim8_ch4);
DMA_STREAM_DEFINE(2, 7, 7, tim8_trig);
DMA_STREAM_DEFINE(2, 7, 7, tim8_com);

DMA_STREAM_DEFINE(2, 8, 0, dfsdm1_flt0);
DMA_STREAM_DEFINE(2, 8, 1, dfsdm1_flt1);
DMA_STREAM_DEFINE(2, 8, 2, dfsdm1_flt2);
DMA_STREAM_DEFINE(2, 8, 3, dfsdm1_flt3);
DMA_STREAM_DEFINE(2, 8, 4, dfsdm1_flt0);
DMA_STREAM_DEFINE(2, 8, 5, dfsdm1_flt1);
DMA_STREAM_DEFINE(2, 8, 6, dfsdm1_flt2);
DMA_STREAM_DEFINE(2, 8, 7, dfsdm1_flt3);

DMA_STREAM_DEFINE(2, 9, 0, jpeg_in);
DMA_STREAM_DEFINE(2, 9, 1, jpeg_out);
DMA_STREAM_DEFINE(2, 9, 2, spi4_tx);
DMA_STREAM_DEFINE(2, 9, 3, jpeg_in);
DMA_STREAM_DEFINE(2, 9, 4, jpeg_out);
DMA_STREAM_DEFINE(2, 9, 5, spi5_rx);

DMA_STREAM_DEFINE(2, 10, 0, sai1_b);
DMA_STREAM_DEFINE(2, 10, 1, sai2_b);
DMA_STREAM_DEFINE(2, 10, 2, sai2_a);
DMA_STREAM_DEFINE(2, 10, 6, sai1_a);

DMA_STREAM_DEFINE(2, 11, 0, sdmmc2);
DMA_STREAM_DEFINE(2, 11, 2, suadspi);
DMA_STREAM_DEFINE(2, 11, 5, sdmmc2);

#define SPI_CFG_DEFINE(n) \
    struct stm32_spi_cfg spi ## n ## _cfg = {                   \
        .spi_num = n,                                           \
        .spi = SPI ## n,                                        \
        .i2s_irq = SPI ## n ## _IRQn,                           \
        .driver_data = &stm32_i2s ## n,                         \
        .irq_handler = i2s ## n ## _irq_handler,                \
        .i2s_dma_handler = i2s ## n ## _dma_stream_irq_handler, \
        .hdma_spi = &hdma_spi ## n,                             \
        .enable_clock = i2s ## n ## _clock_enable,              \
    }

#define I2S_CFG_DEFINE(n) \
    struct stm32_spi_cfg spi ## n ## _cfg = {                         \
        .spi_num = n,                                                 \
        .spi = SPI ## n,                                              \
        .i2s_irq = SPI ## n ## _IRQn,                                 \
        .driver_data = &stm32_i2s ## n,                               \
        .irq_handler = i2s ## n ## _irq_handler,                      \
        .i2s_dma_handler = i2s ## n ## _dma_stream_irq_handler,       \
        .i2sext_dma_handler = i2s ## n ## ext_dma_stream_irq_handler, \
        .hdma_spi = &hdma_spi ## n,                                   \
        .hdma_i2sext = &hdma_i2s ## n ## ext,                         \
        .enable_clock = i2s ## n ## _clock_enable,                    \
    }

#ifdef SPI1
static DMA_HandleTypeDef hdma_spi1;
SPI_CFG_DEFINE(1);
#endif
#ifdef SPI2
static DMA_HandleTypeDef hdma_spi2;
SPI_CFG_DEFINE(2);
#endif
#ifdef SPI3
static DMA_HandleTypeDef hdma_spi3;
SPI_CFG_DEFINE(3);
#endif
